{"meta":{"title":"YONGKANG YANG","subtitle":null,"description":"","author":"Yongkang Yang","url":"https://yongkang-yang.github.io","root":"/"},"pages":[{"title":"About Yongkang Yang","date":"2025-01-01T00:08:23.000Z","updated":"2025-05-31T13:54:11.563Z","comments":true,"path":"about/index.html","permalink":"https://yongkang-yang.github.io/about/index.html","excerpt":"","text":"Personal website"}],"posts":[{"title":"Exploring the Potential of NotebookLM for Researchers","slug":"Exploring-the-Potential-of-NotebookLM-for-Researchers","date":"2024-12-06T15:41:58.000Z","updated":"2025-05-31T13:54:11.563Z","comments":true,"path":"posts/d86215b0/","permalink":"https://yongkang-yang.github.io/posts/d86215b0/","excerpt":"NotebookLM, a new innovation from Google Labs, is described as: a personalized AI research assistant that helps you organize and understand the information that matters most to you. This groundbreaking tool lets you upload a wide range of materials—local PDFs, Google Docs, slides, websites, and even copied text—into a “notebook.” The AI within NotebookLM can then help summarize the content, generate a table of contents, create timelines of events, or even produce a podcast version of your notes. I found this idea super interesting and decided to incorporate it into my daily research workflow. One scenario, in particular, stood out as extremely helpful. I explore the other possibilities as well.","text":"NotebookLM, a new innovation from Google Labs, is described as: a personalized AI research assistant that helps you organize and understand the information that matters most to you. This groundbreaking tool lets you upload a wide range of materials—local PDFs, Google Docs, slides, websites, and even copied text—into a “notebook.” The AI within NotebookLM can then help summarize the content, generate a table of contents, create timelines of events, or even produce a podcast version of your notes. I found this idea super interesting and decided to incorporate it into my daily research workflow. One scenario, in particular, stood out as extremely helpful. I explore the other possibilities as well. Streamlining Journal SubmissionFor many researchers, the journal submission process is a tedious and often frustrating task. One particularly challenging example is submitting to the Journal of Applied Psychology. The submission process requires carefully navigating numerous requirements, which are easy to overlook and time-consuming to decipher. This is where NotebookLM shines. By leveraging its ability to extract and distill information from various sources, you can create a personalized notebook for journal submission requirements. For instance, imagine having a “Journal of Applied Psychology Notebook” or an “AOM Submission Guideline Notebook” where all the critical details are readily available and AI-assisted queries provide instant answers to your questions. Instead of scrolling through long documents to check authorship credit guidelines or formatting rules, you can simply ask your notebook specific questions: What are the authorship credit requirements in APA style? What are the word limits for submissions to AOM? This not only saves time but also significantly reduces the likelihood of errors in your submissions. Beyond journal submissions, NotebookLM offers numerous opportunities to streamline other aspects of research: Literature ReviewConducting a literature review often involves synthesizing insights from hundreds of papers. NotebookLM can: Summarize key findings. Organize papers by themes or chronological order. Generate timelines of developments in a specific field (similar to Connect Papers). For example, you could upload several papers (most important papers, source limit is up to 50 sources) on cultural diversity in teams and ask NotebookLM to summarize the main theories, research methods, and findings. This would help you quickly identify gaps or trends in the literature. Conference PreparationPreparing for conferences is another area where NotebookLM can help. Upload your presentation materials, notes, and relevant papers to your notebook. The AI can summarize potential Q&amp;A topics, highlight gaps in your presentation, or even simulate a mock Q&amp;A session. Teaching and TrainingFor academics involved in teaching, NotebookLM can be an invaluable tool. It allows you to organize course materials, generate lesson summaries, and even prepare quizzes or discussion questions based on your uploaded content.","categories":[{"name":"Software","slug":"Software","permalink":"https://yongkang-yang.github.io/categories/Software/"}],"tags":[{"name":"NotebookLM","slug":"NotebookLM","permalink":"https://yongkang-yang.github.io/tags/NotebookLM/"}],"author":"Yongkang Yang"},{"title":"Top Plugins for Enhancing Your Zotero Workflow","slug":"Top-Plugins-for-Enhancing-Your-Zotero-Workflow","date":"2024-12-06T14:30:41.000Z","updated":"2025-05-31T13:54:11.563Z","comments":true,"path":"posts/3d8f8e4e/","permalink":"https://yongkang-yang.github.io/posts/3d8f8e4e/","excerpt":"If you’re a Zotero user, you likely already know how powerful this reference manager can be for organizing and managing research. However, did you know that with the right plugins, you can supercharge its functionality? I’ve explored numerous Zotero plugins and found a handful that significantly improve workflow and efficiency. These plugins are compatible with Zotero 7 and add exciting features ranging from better citation handling to enhanced attachment management. Below, I’ve detailed each plugin to help you decide which ones might suit your needs. Jasminum, Zotero-better-bibtex, Ethereal, Zotero-shortdoi, Zotero-attanger, Zotero-addons, Green Frog, Zotero-scipdf.","text":"If you’re a Zotero user, you likely already know how powerful this reference manager can be for organizing and managing research. However, did you know that with the right plugins, you can supercharge its functionality? I’ve explored numerous Zotero plugins and found a handful that significantly improve workflow and efficiency. These plugins are compatible with Zotero 7 and add exciting features ranging from better citation handling to enhanced attachment management. Below, I’ve detailed each plugin to help you decide which ones might suit your needs. Jasminum, Zotero-better-bibtex, Ethereal, Zotero-shortdoi, Zotero-attanger, Zotero-addons, Green Frog, Zotero-scipdf. Zotero-addonsZotero-addons is like the “Google Play Store” for Zotero 7. It allows you to easily discover, install, and manage plugins directly from a central market list. Even better, it supports automatic updates, ensuring that your favorite plugins are always up to date. Zotero-better-bibtexBetter BibTeX is a must-have for anyone working extensively with LaTeX or writing academic papers. It streamlines citation management, offering advanced export options, citation key generation, and real-time syncing of BibTeX or BibLaTeX libraries. Zotero-attangerThis is an essential tool for managing your attachments in Zotero 7. Zotero-attanger is effectively the successor to Zotfile for Zotero 6, letting you organize, rename, and relocate attachments with ease. JasminumJasminum can recognize metadata from Chinese journals. For users who cite these papers and want to keep a good record of these papers. EtherealEthereal is a stylish plugin that refines Zotero’s appearance and functionality. Perfect for those who value both form and function, this plugin ensures your reference manager is visually appealing without compromising on performance. An example of my zotero below: the right side of the tags are made from Ethereal. Zotero-shortdoiSharing DOIs can be cumbersome due to their length. Zotero-shortdoi generates shorter and more manageable DOI links directly within Zotero, making it easier to share references with collaborators or in documents. Green FrogGreen Frog keeps your library accurate by updating the Impact Factors (IFs) and the journal information of journal entries (year, journal name, title, author, etc.) from easyScholar (need to log in easyScholar) in your Zotero database. The embeded function in Zotero often fails to update the Publication year. Zotero-scipdfDownload PDF from Scihub. It supports batch download as well.","categories":[{"name":"Software","slug":"Software","permalink":"https://yongkang-yang.github.io/categories/Software/"}],"tags":[{"name":"Zotero 7 Plugins","slug":"Zotero-7-Plugins","permalink":"https://yongkang-yang.github.io/tags/Zotero-7-Plugins/"},{"name":"Jaminum","slug":"Jaminum","permalink":"https://yongkang-yang.github.io/tags/Jaminum/"},{"name":"Zotero-better-bibtex","slug":"Zotero-better-bibtex","permalink":"https://yongkang-yang.github.io/tags/Zotero-better-bibtex/"},{"name":"Ethereal","slug":"Ethereal","permalink":"https://yongkang-yang.github.io/tags/Ethereal/"},{"name":"Zotero-shortdoi","slug":"Zotero-shortdoi","permalink":"https://yongkang-yang.github.io/tags/Zotero-shortdoi/"},{"name":"Zotero-attanger","slug":"Zotero-attanger","permalink":"https://yongkang-yang.github.io/tags/Zotero-attanger/"},{"name":"Zotero-addons","slug":"Zotero-addons","permalink":"https://yongkang-yang.github.io/tags/Zotero-addons/"},{"name":"Green Frog","slug":"Green-Frog","permalink":"https://yongkang-yang.github.io/tags/Green-Frog/"},{"name":"Zotero-scipdf","slug":"Zotero-scipdf","permalink":"https://yongkang-yang.github.io/tags/Zotero-scipdf/"}],"author":"Yongkang Yang"},{"title":"RSS Feed","slug":"RSS-Feed","date":"2024-11-22T23:09:02.000Z","updated":"2025-05-31T13:54:11.563Z","comments":true,"path":"posts/89f1b92c/","permalink":"https://yongkang-yang.github.io/posts/89f1b92c/","excerpt":"","text":"This site is available on RSS feed. Add this link: https://www.yongkang-yang.github.io/atom.xml to you RSS reader to follow the latest updates.","categories":[{"name":"Blog","slug":"Blog","permalink":"https://yongkang-yang.github.io/categories/Blog/"}],"tags":[{"name":"RSS","slug":"RSS","permalink":"https://yongkang-yang.github.io/tags/RSS/"}],"author":"Yongkang Yang"},{"title":"How to test moderation in growth modeling","slug":"How-to-test-moderation-in-growth-modeling","date":"2024-09-03T00:02:42.000Z","updated":"2025-05-31T13:54:11.563Z","comments":true,"path":"posts/c622061/","permalink":"https://yongkang-yang.github.io/posts/c622061/","excerpt":"The outcome is repeatedly measured in the moderation. There are two papers explaining the methods behind: Curran, P. J., Bauer, D. J., &amp; Willoughby, M. T. (2004). Testing main effects and interactions in latent curve analysis. Psychological Methods, 9(2), 220-237. Preacher, K. J., Curran, P. J., &amp; Bauer, D. J. (2006). Computational tools for probing interactions in multiple linear regression, multilevel modeling, and latent curve analysis. Journal of Educational and Behavioral Statistics, 31(4), 437-448. Note: online tools mentioned in this paper could be found at: http://www.quantpsy.org/interact/index.htm","text":"The outcome is repeatedly measured in the moderation. There are two papers explaining the methods behind: Curran, P. J., Bauer, D. J., &amp; Willoughby, M. T. (2004). Testing main effects and interactions in latent curve analysis. Psychological Methods, 9(2), 220-237. Preacher, K. J., Curran, P. J., &amp; Bauer, D. J. (2006). Computational tools for probing interactions in multiple linear regression, multilevel modeling, and latent curve analysis. Journal of Educational and Behavioral Statistics, 31(4), 437-448. Note: online tools mentioned in this paper could be found at: http://www.quantpsy.org/interact/index.htm Though moderation was not a main focus in this classic paper, gender as a moderator appeared in the growth modeling. Ployhart, R. E., &amp; Vandenberg, R. J. (2010). Longitudinal research: The theory, design, and analysis of change. Journal of management, 36(1), 94-120. Two example articles deployed moderation in latent growth modeling: AMJ: more details in Online Supplemental Materials: Deng, Y., Lin, W., Song, Y., Wang, M., Cai, D., &amp; Liu, J. (In press). Socialization as a political arena: A multi-agent interactionist perspective to understand political skill and newcomer socialization rates. Academy of Management Journal. JAP: Multilevel moderation Miron-Spektor, E., Vashdi, D. R., &amp; Gopher, H. (2022). Bright sparks and enquiring minds: Differential effects of goal orientation on the creativity trajectory. Journal of Applied Psychology, 107(2), 310-218.","categories":[{"name":"Research Method","slug":"Research-Method","permalink":"https://yongkang-yang.github.io/categories/Research-Method/"}],"tags":[{"name":"growth modeling","slug":"growth-modeling","permalink":"https://yongkang-yang.github.io/tags/growth-modeling/"},{"name":"moderation","slug":"moderation","permalink":"https://yongkang-yang.github.io/tags/moderation/"}],"author":"Yongkang Yang"},{"title":"ChatGPT helps me in my academic writing","slug":"ChatGPT helps me in my academic writing","date":"2024-09-01T21:34:24.000Z","updated":"2025-05-31T13:54:11.563Z","comments":true,"path":"posts/d4c8fa66/","permalink":"https://yongkang-yang.github.io/posts/d4c8fa66/","excerpt":"","text":"Some useful prompts for academic writing from a recent article in Nature Career Column.. The value that I derive from generative AI is not from the technology itself blindly churning out text, but from engaging with the tool and using my own expertise to refine what it produces. ——Dritjon Gruda Polishing academic writing I’m writing a paper on [topic] for a leading [discipline] academic journal. What I tried to say in the following section is [specific point]. Please rephrase it for clarity, coherence and conciseness, ensuring each paragraph flows into the next. Remove jargon. Use a professional tone. if it’s not what you want or you want to improve its output: This isn’t quite what I meant. Let’s adjust this part. or This is much clearer, but let’s tweak the ending for a stronger transition to the next section. Elevating peer review Assume you’re an expert and seasoned scholar with 20+ years of academic experience in [field]. On the basis of my summary of a paper in [field], where the main focus is on [general topic], provide a detailed review of this paper, in the following order: 1) briefly discuss its core content; 2) identify its limitations; and 3) explain the significance of each limitation in order of importance. Maintain a concise and professional tone throughout. Optimizing editorial feedback On the basis of these notes, draft a letter to the author. Highlight the manuscript’s key issues and clearly explain why the manuscript, despite its interesting topic, might not provide a substantial enough advancement to merit publication. Avoid jargon. Be direct. Maintain a professional and respectful tone throughout. More useful prompts: Response letter Assume you’re an expert and seasoned scholar with 20+ years of academic experience in XXX research. [Abstract.] –use this information throughout our conversation. Now reviewers have a few comments about our paper, please understand reviewers’ questions carefully and respond to their concerns using a concise and professional tone throughout. I will provide you with the comments from reviewers. Please give me your response regarding how you addressed their concerns. I will also provide you with some guidance. to be continued Discussion: ChatGPT is transforming peer review — how can we use it responsibly? LLM use must be restricted to specific tasks — to correct language and grammar, answer simple manuscript-related questions and identify relevant information, for instance.","categories":[{"name":"Research","slug":"Research","permalink":"https://yongkang-yang.github.io/categories/Research/"}],"tags":[{"name":"ChatGPT","slug":"ChatGPT","permalink":"https://yongkang-yang.github.io/tags/ChatGPT/"},{"name":"Academic writing","slug":"Academic-writing","permalink":"https://yongkang-yang.github.io/tags/Academic-writing/"}],"author":"Yongkang Yang"},{"title":"How to find scales?","slug":"How-to-find-scales","date":"2024-07-26T15:45:11.000Z","updated":"2025-05-31T13:54:11.563Z","comments":true,"path":"posts/98101af5/","permalink":"https://yongkang-yang.github.io/posts/98101af5/","excerpt":"Scales There are scales available in the website. For example: The Decision Making Individual Differences Inventory (DMIDI) The DMIDI is a catalogue of over 200 individual difference measures commonly used in judgment and decision-making research. An alphabetical list of all of the over 170 measures covered by the DMIDI: https://sjdm.org/dmidi/All_Scales.html OBHRM百科-A Chinese website OBHRM百科是一个国内OBHRM学者共建共享的OBHRM公益知识库。我们坚信，通过所有同仁的共同努力，可以为国内OBHRM研究、教学创造更便利的条件。","text":"Scales There are scales available in the website. For example: The Decision Making Individual Differences Inventory (DMIDI) The DMIDI is a catalogue of over 200 individual difference measures commonly used in judgment and decision-making research. An alphabetical list of all of the over 170 measures covered by the DMIDI: https://sjdm.org/dmidi/All_Scales.html OBHRM百科-A Chinese website OBHRM百科是一个国内OBHRM学者共建共享的OBHRM公益知识库。我们坚信，通过所有同仁的共同努力，可以为国内OBHRM研究、教学创造更便利的条件。 For English Scales For Chinese Scales Edmondson (1999) in Appendix Supportiveness of organization context Task design Clear Direction Team composition Team efficacy Team psychological Safety Team Learning Coaching Team learning behavior Team performance Internal motivation Team learning behavior (observer) Team performance (obseerver) Surveys &amp; Tools Google Scholar If you find one relevant scale but the paper only revealed on item or two. Then it's easy to use the keyword searching like: \"scale name or author name\" + \"example item\".","categories":[{"name":"Research","slug":"Research","permalink":"https://yongkang-yang.github.io/categories/Research/"}],"tags":[{"name":"scales","slug":"scales","permalink":"https://yongkang-yang.github.io/tags/scales/"},{"name":"measures","slug":"measures","permalink":"https://yongkang-yang.github.io/tags/measures/"}],"author":"Yongkang Yang"},{"title":"Mplus Code for Measurement invariance and LCS model","slug":"Mplus-Code-for-Measurement-invariance-and-LCS-model","date":"2024-06-14T16:44:41.000Z","updated":"2025-05-31T13:54:11.563Z","comments":true,"path":"posts/b97fc5b4/","permalink":"https://yongkang-yang.github.io/posts/b97fc5b4/","excerpt":"InfoClick this link to access the file OSF link Reference: Li, W.-D., Wang, J., Allen, T., Zhang, X., Yu, K., Zhang, H., Huang, J. L., Liu, M., &amp; Li, A. (2024). Getting under the skin? Influences of work–family experiences on personality trait adaptation and reciprocal relationships. Journal of Personality and Social Psychology, 126(4), 694–718. https://doi.org/10.1037/pspp0000476","text":"InfoClick this link to access the file OSF link Reference: Li, W.-D., Wang, J., Allen, T., Zhang, X., Yu, K., Zhang, H., Huang, J. L., Liu, M., &amp; Li, A. (2024). Getting under the skin? Influences of work–family experiences on personality trait adaptation and reciprocal relationships. Journal of Personality and Social Psychology, 126(4), 694–718. https://doi.org/10.1037/pspp0000476 Strongly Recommend Prof. Wendong Li’s Website for longitudinal research: https://www.wendongli.com/index.php/for-sharing/ Latent change score model A Replication of Matusik et al (2021) The results and Mplus code can be found in this repo: Mplus Code of Steffen et al (2021) syntax12345678910111213141516171819202122232425262728293031323334353637383940Mplus syntax for hypothesis 1 sensitivity analysisTITLE: Merger paper H1DATA: FILE IS &#x27;g:/my drive/merger/latent.dat&#x27;;VARIABLE: NAMES ARE merge size js5 js7 abs5 abs7 ss5 ss7; USEVARIABLES ARE merge size js5 js7; MODEL: !Latent True Scores js1 BY js5@1; js2 BY js7@1; !Specifies the mean and variance of js1. [js1]; js1; !Fixes the mean and variance of js2 to 0. [js2@0]; js2@0; [js5-js7@0]; !Sets the residual variances of js5 and js7 to be equal and labels them as resvar. js5-js7 (resvar); !Autoregressions js2 ON js1@1; !Latent Change Factors jsd BY js2@1; !Fixes the mean and variance of jsd to 0. [jsd@0]; jsd@0; !Hypothesis jsd ON merge size;OUTPUT: STAND CINT;","categories":[{"name":"Research Method","slug":"Research-Method","permalink":"https://yongkang-yang.github.io/categories/Research-Method/"}],"tags":[{"name":"measurement invariance","slug":"measurement-invariance","permalink":"https://yongkang-yang.github.io/tags/measurement-invariance/"},{"name":"latent change score model","slug":"latent-change-score-model","permalink":"https://yongkang-yang.github.io/tags/latent-change-score-model/"}],"author":"Yongkang Yang"},{"title":"How to batch edit title case into sentence case for multiple items in Zotero","slug":"How-to-batch-edit-title-case-into-sentence-case-for-multuple-items","date":"2024-06-13T15:45:50.000Z","updated":"2025-05-31T13:54:11.563Z","comments":true,"path":"posts/Infinity/","permalink":"https://yongkang-yang.github.io/posts/Infinity/","excerpt":"Zotero users might use APA 7th for their reference. There is a problem when the metadata in Zotero is title case, it is laborious to change it every time to sentence case. I found a java script that can take care of all items at once.","text":"Zotero users might use APA 7th for their reference. There is a problem when the metadata in Zotero is title case, it is laborious to change it every time to sentence case. I found a java script that can take care of all items at once. Usage: copy the code below Zotero-Tools-Developer-Run JavaScript 1234567891011121314zoteroPane = Zotero.getActiveZoteroPane();items = zoteroPane.getSelectedItems();var result = &quot;&quot;;for (item of items) &#123;var title = item.getField(&#x27;title&#x27;);result += &quot; &quot; + title + &quot;\\n&quot;;var new_title = title.replace(/\\b([A-Z][a-z0-9]+|A)\\b/g, function (x) &#123; return x.toLowerCase(); &#125;);new_title = new_title.replace(/(^|\\?\\s*)[a-z]/, function (x) &#123; return x.toUpperCase(); &#125;);result += &quot;-&gt; &quot; + new_title + &quot;\\n\\n&quot;;// // Do it at your own risk item.setField(&#x27;title&#x27;, new_title); await item.saveTx();&#125;return result; The only issue is that it can’t uppercase the first letter after the “:” there is still minimum work to be done, but I am not an expert in Java so if you find a better way, just let me know. If you want all title case, you can try another script below: 123456789101112131415161718192021222324252627282930313233var items = ZoteroPane.getSelectedItems();var n = 0;for (item of items) &#123; var title = item.getField(&#x27;title&#x27;); new_title = titleCase(title). // convert to title case replace(&#x27;And&#x27;, &#x27;and&#x27;). // replace &#x27;And&#x27; replace(&#x27;For&#x27;, &#x27;for&#x27;). // replace &#x27;For&#x27; replace(&#x27;In&#x27;, &#x27;in&#x27;). // replace &#x27;In&#x27; replace(&#x27;Of&#x27;, &#x27;of&#x27;). // replace &#x27;Of&#x27; replace(&#x27;With&#x27;, &#x27;with&#x27;). replace(&#x27;Usa&#x27;, &#x27;USA&#x27;). replace(&#x27;Dna&#x27;, &#x27;DNA&#x27;). replace(&#x27;Pcr&#x27;, &#x27;PCR&#x27;). replace(&#x27;Ros&#x27;, &#x27;ROS&#x27;). replace(&#x27;To&#x27;, &#x27;to&#x27;) item.setField(&#x27;title&#x27;, new_title); await item.saveTx(); n ++&#125;;return n + &#x27;个条目的题目大小写转为词首字母大写，有些特殊缩写单词可能转换错误，请查实。&#x27;;// 将单词转为首字母大写function titleCase(str) &#123; var newStr = str.split(&quot; &quot;); for(var i = 0; i &lt; newStr.length; i++) &#123; newStr[i] = newStr[i].slice(0,1).toUpperCase() + newStr[i].slice(1).toLowerCase(); &#125; return newStr.join(&quot; &quot;);&#125;; Note: Before run the script, make sure the metadata (year, author name, doi, etc.) are right. Reference: Find other useful scripts in Zotero, click: zotero-javascripts","categories":[{"name":"Software","slug":"Software","permalink":"https://yongkang-yang.github.io/categories/Software/"}],"tags":[{"name":"zotero","slug":"zotero","permalink":"https://yongkang-yang.github.io/tags/zotero/"},{"name":"javascript","slug":"javascript","permalink":"https://yongkang-yang.github.io/tags/javascript/"},{"name":"sentence case","slug":"sentence-case","permalink":"https://yongkang-yang.github.io/tags/sentence-case/"}],"author":"Yongkang Yang"},{"title":"How to keep track of the latest journal articles","slug":"How-to-keep-track-of-the-latest-journal-articles","date":"2024-06-13T15:36:11.000Z","updated":"2025-05-31T13:54:11.563Z","comments":true,"path":"posts/2bab4f46/","permalink":"https://yongkang-yang.github.io/posts/2bab4f46/","excerpt":"Probably just me, every once a while, I feel myself anxious being left behind about the latest literature in my field. So, for a long time, I’ve been trying to find a perfect way to keep track of the latest journal articles. I found my final answer, but tried different methods along the way, and you may find other solutions fit you better. I hereby recommend three main approaches for your consideration.","text":"Probably just me, every once a while, I feel myself anxious being left behind about the latest literature in my field. So, for a long time, I’ve been trying to find a perfect way to keep track of the latest journal articles. I found my final answer, but tried different methods along the way, and you may find other solutions fit you better. I hereby recommend three main approaches for your consideration. Email Alert All the journals can be found in publication companies like, Willey, Springer, Sage, Elsevier, etc. For example, in Elsevier, you can find OB related journals: Journal of Business Research, Journal of Business Venturing, Journal of Vocational Behavior, Organizational Behavior and Human Decision Processes. By signing up the Elsevier, you are able to follow all these journal by email alert (see a screenshot below). It’s the same for Willy, Sage and other publishers only if you know which journal is in which publisher. RSS subscription The email alert is a perfect way but for people who are less likely to put everything in the mailbox, it would be overwhelming whenever you open the mailbox and find hundreds of unread journal articles. Although these emails can be put in a separate folder and do not disturb your mail inbox, the pressure is still hanging there. Another solution is therefore to find a place to put this articles independently. RSS offers the perfect solution in this regard. RSS is a web feed that allows users and applications to access updates to websites in a standardized, computer-readable format. RSS readers like Feedly, Inoreader, or other embedded RSS service in outlook or Zotero can recognize RSS feeds and generate reading interface. I recommend Zotero because you can easily include articles into your collection and then cite the paper when you need. The interface looks like blow: When you click one journal, for example, Academy of management Annals, you are able to read the article by clicking the paper, and Zotero will redirect you to the original page, if you find this paper interesting, you can also “add to your library”. Browzine Okay, the final solution, at least to me. I don’t like RSS as it does not strictly follow the chronical order. Currently, I am using the Browzine, a magazine-like reading experience (see a screenshot below). You will need University authorization to use. Please contact your library if you are unsure about it. In the end, it’s more important to read the paper than finding ways to follow the paper. If you are active in the filed, papers will reach out to you.","categories":[{"name":"Tips","slug":"Tips","permalink":"https://yongkang-yang.github.io/categories/Tips/"}],"tags":[{"name":"rss","slug":"rss","permalink":"https://yongkang-yang.github.io/tags/rss/"},{"name":"email alert","slug":"email-alert","permalink":"https://yongkang-yang.github.io/tags/email-alert/"},{"name":"browzine","slug":"browzine","permalink":"https://yongkang-yang.github.io/tags/browzine/"}],"author":"Yongkang Yang"},{"title":"Welcome to my site!","slug":"Blog","date":"2024-06-04T22:59:54.000Z","updated":"2025-05-31T13:54:11.563Z","comments":true,"path":"posts/4f1dc535/","permalink":"https://yongkang-yang.github.io/posts/4f1dc535/","excerpt":"","text":"Hi there, welcome to Yongkang’s Blog. I created this blog to document my learning and reflections in research. Feel free to comment or share, if you find any mistakes or anything unavailable or outdated, please email me at research@yongkangyang.com.test1","categories":[{"name":"Blog","slug":"Blog","permalink":"https://yongkang-yang.github.io/categories/Blog/"}],"tags":[{"name":"support","slug":"support","permalink":"https://yongkang-yang.github.io/tags/support/"}],"author":"Yongkang Yang"}],"categories":[{"name":"Software","slug":"Software","permalink":"https://yongkang-yang.github.io/categories/Software/"},{"name":"Blog","slug":"Blog","permalink":"https://yongkang-yang.github.io/categories/Blog/"},{"name":"Research Method","slug":"Research-Method","permalink":"https://yongkang-yang.github.io/categories/Research-Method/"},{"name":"Research","slug":"Research","permalink":"https://yongkang-yang.github.io/categories/Research/"},{"name":"Tips","slug":"Tips","permalink":"https://yongkang-yang.github.io/categories/Tips/"}],"tags":[{"name":"NotebookLM","slug":"NotebookLM","permalink":"https://yongkang-yang.github.io/tags/NotebookLM/"},{"name":"Zotero 7 Plugins","slug":"Zotero-7-Plugins","permalink":"https://yongkang-yang.github.io/tags/Zotero-7-Plugins/"},{"name":"Jaminum","slug":"Jaminum","permalink":"https://yongkang-yang.github.io/tags/Jaminum/"},{"name":"Zotero-better-bibtex","slug":"Zotero-better-bibtex","permalink":"https://yongkang-yang.github.io/tags/Zotero-better-bibtex/"},{"name":"Ethereal","slug":"Ethereal","permalink":"https://yongkang-yang.github.io/tags/Ethereal/"},{"name":"Zotero-shortdoi","slug":"Zotero-shortdoi","permalink":"https://yongkang-yang.github.io/tags/Zotero-shortdoi/"},{"name":"Zotero-attanger","slug":"Zotero-attanger","permalink":"https://yongkang-yang.github.io/tags/Zotero-attanger/"},{"name":"Zotero-addons","slug":"Zotero-addons","permalink":"https://yongkang-yang.github.io/tags/Zotero-addons/"},{"name":"Green Frog","slug":"Green-Frog","permalink":"https://yongkang-yang.github.io/tags/Green-Frog/"},{"name":"Zotero-scipdf","slug":"Zotero-scipdf","permalink":"https://yongkang-yang.github.io/tags/Zotero-scipdf/"},{"name":"RSS","slug":"RSS","permalink":"https://yongkang-yang.github.io/tags/RSS/"},{"name":"growth modeling","slug":"growth-modeling","permalink":"https://yongkang-yang.github.io/tags/growth-modeling/"},{"name":"moderation","slug":"moderation","permalink":"https://yongkang-yang.github.io/tags/moderation/"},{"name":"ChatGPT","slug":"ChatGPT","permalink":"https://yongkang-yang.github.io/tags/ChatGPT/"},{"name":"Academic writing","slug":"Academic-writing","permalink":"https://yongkang-yang.github.io/tags/Academic-writing/"},{"name":"scales","slug":"scales","permalink":"https://yongkang-yang.github.io/tags/scales/"},{"name":"measures","slug":"measures","permalink":"https://yongkang-yang.github.io/tags/measures/"},{"name":"measurement invariance","slug":"measurement-invariance","permalink":"https://yongkang-yang.github.io/tags/measurement-invariance/"},{"name":"latent change score model","slug":"latent-change-score-model","permalink":"https://yongkang-yang.github.io/tags/latent-change-score-model/"},{"name":"zotero","slug":"zotero","permalink":"https://yongkang-yang.github.io/tags/zotero/"},{"name":"javascript","slug":"javascript","permalink":"https://yongkang-yang.github.io/tags/javascript/"},{"name":"sentence case","slug":"sentence-case","permalink":"https://yongkang-yang.github.io/tags/sentence-case/"},{"name":"rss","slug":"rss","permalink":"https://yongkang-yang.github.io/tags/rss/"},{"name":"email alert","slug":"email-alert","permalink":"https://yongkang-yang.github.io/tags/email-alert/"},{"name":"browzine","slug":"browzine","permalink":"https://yongkang-yang.github.io/tags/browzine/"},{"name":"support","slug":"support","permalink":"https://yongkang-yang.github.io/tags/support/"}]}